[
    {
        "company": "Arctic Wolf Networks",
        "position": "Software Engineering - Risk Platform",
        "startDate": "September 2019",
        "endDate": "December 2019",
        "points": [
            "Developed linux version of multi-platform agent in Go which monitors and audits computer activity.",
            "Used Docker and Make to automate build and package processes.",
            "Agent enforces persistent firewall rules to selectively block ports and networks.",
            "Developed, debugged, and deployed code for distributed computing clusters with shared resources.",
            "Updated servers to handle caching, parsing, audit processing, and managing device quarantines."

        ]
    },
    {
        "company": "Capital One",
        "position": "Software Engineering",
        "startDate": "January 2019",
        "endDate": "April 2019",
        "points": [
            "Constructed a Java library to abstract graph algorithms for Amazon Neptune graph database.",
            "Invented patent-pending architecture for data storage and aggregation used in modelling and fraud detection.",
            "Applied machine-learning to model customer behaviour using Python and SciKit-Learn to determine feasibility of new features.",
            "Aggregated millions of data entries to engineer properties that feeds into models."
        ]
    },
    {
        "company": "Acronym Software",
        "position": "C++ Developer ",
        "startDate": "May 2018",
        "endDate": "August 2018",
        "points": [
            "Added a new class of calculations for civil engineering and design.",
            "Designed new data structures extending existing ones to store essential data for new calculations.",
            "Increased efficiency and readability by reorganizing code to be more modular and reusable.",
            "Modified complex calculations to integrate new features into upcoming software release.",
            "Debugged, tested, and shipped beta versions of software to client to demonstrate new functionalities and receive feedback for further improvement."
        ]
    },
    {
        "company": "Imagine Communications",
        "logo": "img/imagine.png",
        "position": "Full Stack Developer",
        "startDate": "September 2017",
        "endDate": "December 2017",
        "points": [
            "Changed code to be asynchronous to increase responsiveness of UI by 800%.",
            "Implemented UI features to impress and secure a major clientele in demo.",
            "Created a new service to address a class of bugs and prevent future ones.",
            "Developed reusable and customizable components to accelerate UI development and create uniformity and cohesion.",
            "Automated stylesheet generation for icons using Node.JS to enable exporting company icons as a reusable package"
        ]
    },
    {
        "company": "Asia Palace Restaurant",
        "logo": "img/asiapalace.jpg",
        "position": "IT and Management",
        "startDate": "January 2016",
        "endDate": "September 2016",
        "points": [
            "Exercised strong communication and organization skills to ensure daily operations and mediate conflicts.",
            "Provided excellent service to establish the “best [Chinese restaurant] in Regina” (from Google reviews).",
            "Maintained company image by providing excellent customer care.",
            "Designed and printed menus, handled advertising, and maintained presence in social media.",
            "Obtained necessary permits for the establishment of the restaurant."
        ]
    }
]
