[
    {
        "name": "Neural Evolution Of Feed-Forward Neural Networks",
        "date": "June 2019",
        "points": [
            "Paper investigating neural evolution networks.",
            "Researched existing techniques used in structurally evolving neural networks.",
            "Investigated capacity for such algorithms to learn strategies and learn in real-time.",
            "Tested different algorithms on a simple task to observe how structures evolve."
        ]
    },
    {
        "name": "Big Brain",
        "date": "October 2019",
        "points": [
            "Used Tensor-Flow to develop a recurrent neural network to generate fake spam emails.",
            "Created proof of concept for AI generated text.",
            "Additionally, trained AI on tweets to create a tweet generator."

        ]
    },
    {
        "name": "Hangman AI",
        "points": [
            "Created a hangman game using AngularJS which stored a database of words entered as words to guess.",
            "Developed an algorithm to determine the most likely letter to appear based on length of given word, letter frequency, and word use frequency.",
            "Bot undefeatable with greater - than - 3 letter words after populating database with 20K words."
        ]
    },
    {
        "name": "NotePadd",
        "link": "https://notepadd.herokuapp.com/",
        "points": [
            "Developed a web - based application by implementing JavaScript to parse English text.",
            "Created a detailed plan by dividing and assigning tasks in manageable chunks.",
            "Created musical rhythms and flows by analyzing and interpreting sentences and word lengths.",
            "Mapped notes to syllables in iambic pentameter to create musical melodies.",
            "Designed and fabricated an intuitive, functional, and visually appealing user interface using Materialize CSS."
        ]
    },
    {
        "name": "WatRGoose",
        "points": [
            "Developed and published an Android application with a small team in the time span of 12 hours, being the only team to demo a project.",
            "Collaboratively learned to use the Android Studio IDE and set up testing devices.",
            "Kept a lighthearted and enthusiastic atmosphere in the team.",
            "Experienced the process of publishing, updating, and fixing bugs across multiple devices."
        ]
    },
    {
        "name": "Robotics Team",
        "points": [
            "Designed a robot using Arduino and CAD in collaboration with a team of young engineers.",
            "Implemented algorithms to make robot follow a strip which encodes audio, then play the audio encoded.",
            "Won award for best chassis through excellent use of CAD and plasma cutting technology."
        ]
    },
    {
        "name": "SHAD Entrepreneurship Cup",
        "points": [
            "Collaboratively invented an innovative product to solve a novel societal problem.",
            "Pitched product to a panel of seasoned professionals and entrepreneurs.",
            "Created a business plan outlining the future growth of the company.",
            "Prototype and presented a sample product.",
            "Won first place for product and pitch in our region."
        ]
    }
]
